/* New message from a specific person, not referencing a room */
"MSG_FROM_USER" = "Message from %@";

/* New message from a specific person in a named room */
"MSG_FROM_USER_IN_ROOM" = "%@ posted in %@";

/* New message from a specific person, not referencing a room. Content included. */
"MSG_FROM_USER_WITH_CONTENT" = "%@: %@";

/* New message from a specific person in a named room. Content included. */
"MSG_FROM_USER_IN_ROOM_WITH_CONTENT" = "%@ in %@: %@";

/* New action message from a specific person, not referencing a room. */
"ACTION_FROM_USER" = "* %@ %@";

/* New action message from a specific person in a named room. */
"ACTION_FROM_USER_IN_ROOM" = "%@: * %@ %@";

/* New action message from a specific person, not referencing a room. */
"IMAGE_FROM_USER" = "%@ sent you a picture %@";

/* New action message from a specific person in a named room. */
"IMAGE_FROM_USER_IN_ROOM" = "%@ posted a picture %@ in %@";

/* A single unread message in a room */
"SINGLE_UNREAD_IN_ROOM" = "You received a message in %@";

/* A single unread message */
"SINGLE_UNREAD" = "You received a message";

/* Multiple unread messages in a room */
"UNREAD_IN_ROOM" = "%@ new messages in %@";

/* Multiple unread messages from a specific person, not referencing a room */
"MSGS_FROM_USER" = "%@ new messages in %@";

/* Multiple unread messages from two people */
"MSGS_FROM_TWO_USERS" = "%@ new messages from %@ and %@";

/* Multiple unread messages from three people */
"MSGS_FROM_THREE_USERS" = "%@ new messages from %@, %@ and %@";

/* Multiple unread messages from two plus people (ie. for 4+ people: 'others' replaces the third person) */
"MSGS_FROM_TWO_PLUS_USERS" = "%@ new messages from %@, %@ and others";

/* Multiple messages in two rooms */
"MSGS_IN_TWO_ROOMS" = "%@ new messages in %@ and %@";

/* Look, stuff's happened, alright? Just open the app. */
"MSGS_IN_TWO_PLUS_ROOMS" = "%@ new messages in %@, %@ and others";

/* A user has invited you to a chat */
"USER_INVITE_TO_CHAT" = "%@ has invited you to chat";

/* A user has invited you to an (unamed) group chat */
"USER_INVITE_TO_CHAT_GROUP_CHAT" = "%@ has invited you to a group chat";

/* A user has invited you to a named room */
"USER_INVITE_TO_NAMED_ROOM" = "%@ has invited you to %@";

/* Incoming one-to-one voice call */
"VOICE_CALL_FROM_USER" = "Call from %@";

/* Incoming one-to-one video call */
"VIDEO_CALL_FROM_USER" = "Video call from %@";

/* Incoming unnamed voice conference invite from a specific person */
"VOICE_CONF_FROM_USER" = "Group call from %@";

/* Incoming unnamed video conference invite from a specific person */
"VIDEO_CONF_FROM_USER" = "Video group call from %@";

/* Incoming named voice conference invite from a specific person */
"VOICE_CONF_NAMED_FROM_USER" = "Group call from %@: '%@'";

/* Incoming named video conference invite from a specific person */
"VIDEO_CONF_NAMED_FROM_USER" = "Video group call from %@: '%@'";

/* No comment */
" (You)" = " (You)";

/* No comment */
"% Untrusted New Devices for %" = "% Untrusted New Devices for %";

/* No comment */
"% has unknown devices" = "% has unknown devices";

/* No comment */
"% is typing" = "% is typing";

/* No comment */
"% joined the room" = "% joined the room";

/* No comment */
"% left the room" = "% left the room";

/* No comment */
"% people are typing" = "% people are typing";

/* No comment */
"% people have unknown devices" = "% people have unknown devices";

/* No comment */
"% people joined the room" = "% people joined the room";

/* No comment */
"% people left the room" = "% people left the room";

/* No comment */
"% people were invited" = "% people were invited";

/* No comment */
"% users have % unknown devices" = "% users have % unknown devices";

/* No comment */
"% wants to chat." = "% wants to chat.";

/* No comment */
"% was added to your friends list!" = "% was added to your friends list!";

/* No comment */
"% was invited" = "% was invited";

/* No comment */
"%d of %d" = "%d of %d";

/* No comment */
", " = ", ";

/* No comment */
"1 user has % unknown devices" = "1 user has % unknown devices";

/* No comment */
"1 user has an unknown device" = "1 user has an unknown device";

/* No comment */
"?n" = "?n";

/* No comment */
"Accept" = "Accept";

/* No comment */
"Access Denied" = "Access Denied";

/* No comment */
"Access Restricted" = "Access Restricted";

/* No comment */
"Active" = "Active";

/* No comment */
"Add Friend" = "Add Friend";

/* No comment */
"Add friends" = "Add friends";

/* No comment */
"An error occured whilst validating the phone number." = "An error occured whilst validating the phone number.";

/* No comment */
"Archive" = "Archive";

/* No comment */
"CODE ERROR" = "CODE ERROR";

/* No comment */
"Cancel" = "Cancel";

/* No comment */
"Change Password" = "Change Password";

/* No comment */
"Change room name" = "Change room name";

/* No comment */
"Change room topic" = "Change room topic";

/* No comment */
"Chat with %" = "Chat with %";

/* No comment */
"Checking QR code…" = "Checking QR code…";

/* No comment */
"Choose Friends" = "Choose Friends";

/* No comment */
"Confirm" = "Confirm";

/* No comment */
"Could not leave the private room with %!" = "Could not leave the private room with %!";

/* No comment */
"Create a Group" = "Create a Group";

/* No comment */
"Creating a group... " = "Creating a group... ";

/* No comment */
"Creating room... tap to cancel" = "Creating room... tap to cancel";

/* No comment */
"Decline" = "Decline";

/* No comment */
"Delete" = "Delete";

/* No comment */
"Delete message" = "Delete message";

/* No comment */
"Disable" = "Disable";

/* No comment */
"Downloading: :percent%" = "Downloading: :percent%";

/* No comment */
"Edit Name" = "Edit Name";

/* No comment */
"Enable" = "Enable";

/* No comment */
"Enable Push in Settings" = "Enable Push in Settings";

/* No comment */
"Enter new password" = "Enter new password";

/* No comment */
"Enter new password again" = "Enter new password again";

/* No comment */
"Error" = "Error";

/* No comment */
"Failed to create room" = "Failed to create room";

/* No comment */
"Friend Added" = "Friend Added";

/* No comment */
"Friend in Private Room" = "Friend in Private Room";

/* No comment */
"Friends" = "Friends";

/* No comment */
"Hold to record" = "Hold to record";

/* No comment */
"Home Server" = "Home Server";

/* No comment */
"Identity Server" = "Identity Server";

/* No comment */
"Ignore" = "Ignore";

/* No comment */
"Invited" = "Invited";

/* No comment */
"Kick" = "Kick";

/* No comment */
"Leave" = "Leave";

/* No comment */
"Leave room?" = "Leave room?";

/* No comment */
"Leaving room" = "Leaving room";

/* No comment */
"Loading attachment... tap to cancel" = "Loading attachment... tap to cancel";

/* No comment */
"Loading... tap to cancel" = "Loading... tap to cancel";

/* No comment */
"Looks like you have logged in with a new device ('%'). Do you want to send this device you room keys?" = "Looks like you have logged in with a new device ('%'). Do you want to send this device you room keys?";

/* No comment */
"Make admin" = "Make admin";

/* No comment */
"Make moderator" = "Make moderator";

/* No comment */
"Make sure the keys match the latest keys on your devices." = "Make sure the keys match the latest keys on your devices.";

/* No comment */
"Make sure the keys match your friend's latest keys on his or her devices." = "Make sure the keys match your friend's latest keys on his or her devices.";

/* No comment */
"Make sure your password is a unique password you don't use anywhere else." = "Make sure your password is a unique password you don't use anywhere else.";

/* No comment */
"Me" = "Me";

/* No comment */
"Name" = "Name";

/* No comment */
"New device" = "New device";

/* No comment */
"New events" = "New events";

/* No comment */
"No Devices for %" = "No Devices for %";

/* No comment */
"No details available." = "No details available.";

/* No comment */
"OK" = "OK";

/* No comment */
"Old Password" = "Old Password";

/* No comment */
"Password" = "Password";

/* No comment */
"Password successfully changed!" = "Password successfully changed!";

/* No comment */
"Passwords don't match!" = "Passwords don't match!";

/* No comment */
"Phone number type is unknown." = "Phone number type is unknown.";

/* No comment */
"Photo Stream" = "Photo Stream";

/* No comment */
"Place the QR code within the frame." = "Place the QR code within the frame.";

/* No comment */
"Please choose another server!" = "Please choose another server!";

/* No comment */
"Please don't use an empty name or a name consisting only of white space!" = "Please don't use an empty name or a name consisting only of white space!";

/* No comment */
"Please don't use an empty password!" = "Please don't use an empty password!";

/* No comment */
"Please go to the Settings app to grant this app access to your photo library, if you want to upload photos or videos." = "Please go to the Settings app to grant this app access to your photo library, if you want to upload photos or videos.";

/* No comment */
"QR Code" = "QR Code";

/* No comment */
"Re-request encryption keys" = "Re-request encryption keys";

/* No comment */
"Release to cancel recording" = "Release to cancel recording";

/* No comment */
"Release to send" = "Release to send";

/* No comment */
"Release to stop recording" = "Release to stop recording";

/* No comment */
"Remove" = "Remove";

/* No comment */
"Remove as moderator" = "Remove as moderator";

/* No comment */
"Resend" = "Resend";

/* No comment */
"Retry" = "Retry";

/* No comment */
"Scan QR Code" = "Scan QR Code";

/* No comment */
"Server" = "Server";

/* No comment */
"Server didn't return anything!" = "Server didn't return anything!";

/* No comment */
"Settings" = "Settings";

/* No comment */
"Share without verification" = "Share without verification";

/* No comment */
"Show Advanced Options" = "Show Advanced Options";

/* No comment */
"Sign In" = "Sign In";

/* No comment */
"Sign Up" = "Sign Up";

/* No comment */
"Sorry, you are not allowed to view the photo library." = "Sorry, you are not allowed to view the photo library.";

/* No comment */
"Start verifying" = "Start verifying";

/* No comment */
"Success" = "Success";

/* No comment */
"Tap here to add friends and start chatting" = "Tap here to add friends and start chatting";

/* No comment */
"That QR code didn't contain a valid Matrix ID!" = "That QR code didn't contain a valid Matrix ID!";

/* No comment */
"The country code is invalid." = "The country code is invalid.";

/* No comment */
"The number provided is invalid." = "The number provided is invalid.";

/* No comment */
"The number provided is too long." = "The number provided is too long.";

/* No comment */
"The number provided is too short." = "The number provided is too short.";

/* No comment */
"Think of a unique nickname that you don't use anywhere else and doesn't contain personal information." = "Think of a unique nickname that you don't use anywhere else and doesn't contain personal information.";

/* No comment */
"This Device" = "This Device";

/* No comment */
"This app currently doesn't support this server's sign in process." = "This app currently doesn't support this server's sign in process.";

/* No comment */
"This app currently doesn't support this server's sign up process." = "This app currently doesn't support this server's sign up process.";

/* No comment */
"This friend is in a private room with you!nAre you sure you want to do that?nThe private room will be left, too!" = "This friend is in a private room with you!nAre you sure you want to do that?nThe private room will be left, too!";

/* No comment */
"This function is deprecated." = "This function is deprecated.";

/* No comment */
"This username is already taken." = "This username is already taken.";

/* No comment */
"To scan QR codes, please go to Settings and allow camera access." = "To scan QR codes, please go to Settings and allow camera access.";

/* No comment */
"Unarchive" = "Unarchive";

/* No comment */
"Unknown devices" = "Unknown devices";

/* No comment */
"Use Custom Identity Server" = "Use Custom Identity Server";

/* No comment */
"User Name" = "User Name";

/* No comment */
"Valid metadata is missing." = "Valid metadata is missing.";

/* No comment */
"View profile" = "View profile";

/* No comment */
"You have % unseen events" = "You have % unseen events";

/* No comment */
"You have % unseen events in % groups" = "You have % unseen events in % groups";

/* No comment */
"You have 1 unseen event" = "You have 1 unseen event";

/* No comment */
"You have been invited to the room ´%@´." = "You have been invited to the room ´%@´.";

/* No comment */
"Your room chat history will be wiped away. To keep these chats, archive the room instead." = "Your room chat history will be wiped away. To keep these chats, archive the room instead.";

/* No comment */
"blocked" = "blocked";

/* No comment */
"disabled" = "disabled";

/* No comment */
"enabled" = "enabled";

/* No comment */
"new" = "new";

/* No comment */
"offline" = "offline";

/* No comment */
"offline, last active % ago" = "offline, last active % ago";

/* No comment */
"online" = "online";

/* No comment */
"unavailable, last active % ago" = "unavailable, last active % ago";

/* No comment */
"unknown state" = "unknown state";

/* No comment */
"unverified" = "unverified";

/* No comment */
"verified" = "verified";

"Find your friend on Matrix" = "Find your friend on Zom";

"@bob:matrix.org" = "@bob:nang.zom.im";

"Enter your friend's Matrix ID. Yours is" = "Enter your friend's Zom ID. Yours is";
